src/InformationRegisters/СвойстваОтветовНаТребования/СвойстваОтветовНаТребования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваОтветовНаТребования</name>
  <attributes>
    <name>ДатаОтвета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтветаИзмененная</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиТребования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДоОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКритическаяОшибкаОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КалендарьБылНезаполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОтветов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветНеПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвердитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалосьРазобратьPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветУжеДан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <comment>Срок оплаты для КНД 1160001</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТребования</name>
    <comment>Служебные данные</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждениеОтправилОператор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.ДокументыРеализацииПолномочийНалоговыхОрганов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СвойстваОтветовНаТребования/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		КалендарьБылНезаполнен = Ложь;
		
		ПодтверждениеОтправилОператор = ТребованияФНСВызовСервера.ПодтверждениеОтправилОператор(Запись.Ссылка);
		
		// Дата Ответа Рассчитанная
		Если (ЗначениеЗаполнено(Запись.ДатаПодтверждения) ИЛИ ПодтверждениеОтправилОператор)
			И ЗначениеЗаполнено(Запись.ДнейДоОтвета) Тогда
			
			Если ПодтверждениеОтправилОператор Тогда
				Результат = ТребованияФНС.ДатаПлюсДниПоКалендарю(Запись.ДатаОтправкиТребования, Запись.ДнейДоОтвета);
			Иначе
				Результат = ТребованияФНС.ДатаПлюсДниПоКалендарю(Запись.ДатаПодтверждения, Запись.ДнейДоОтвета);
			КонецЕсли;
			
			Запись.ОтветитьДо = Результат.Дата;
			
			Если НЕ Результат.КалендарьЗаполнен Тогда
				КалендарьБылНезаполнен = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.ПодтвердитьДо)
			И ЗначениеЗаполнено(Запись.ДатаОтправкиТребования) Тогда
			
			Результат = ТребованияФНС.ДатаПлюсДниПоКалендарю(Запись.ДатаОтправкиТребования, 6);
			Запись.ПодтвердитьДо = Результат.Дата;
			
			Если НЕ Результат.КалендарьЗаполнен Тогда
				КалендарьБылНезаполнен = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Запись.КалендарьБылНезаполнен = КалендарьБылНезаполнен;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
